Revit 2026 API

# RebarFreeFormAccessorSetLayoutAsFixedNumber Method

---

Sets the Layout Rule property of rebar set to Fixed Number.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLayoutAsFixedNumber(
	int numberOfBars
)
```
```vb
Public Sub SetLayoutAsFixedNumber (
	numberOfBars As Integer
)
```
```cpp
public:
void SetLayoutAsFixedNumber(
	int numberOfBars
)
```
```fsharp
member SetLayoutAsFixedNumber :
        numberOfBars : int -> unit
```

#### Parameters

numberOfBars Int32
     The number of bars in set.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID. |

#### Reference

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace